#!  anaconda3.6
# -*- coding:utf-8 -*-
# Author   : Simsimi
# @Time    : 19-1-3 下午6:12
# @File    : matplotlib_demo.py
# @Software: PyCharm

import matplotlib.pyplot as plt
import matplotlib.font_manager as mfm


# 设置中文字体
my_font = mfm.FontProperties(fname='/usr/share/fonts/wps-office/FZWBK.TTF')

##############################################################
# 折线图
##############################################################
# x = range(2, 26, 2)
# y =  [15, 13, 14.5, 17, 20, 25, 26, 26, 24,   22, 18, 15]
# y1 = [15, 18,   22, 24, 26, 26, 25, 20, 17, 14.5, 13, 15]
# # 设置图片相关信息
# fig = plt.figure(figsize=(15,8),  # 图像尺寸
#                  dpi=80)          # 清晰度
# # 画图
# plt.plot(x, y,
#          label="北京",
#          color="orange",
#          linestyle= ":")
# plt.plot(x, y1,
#          label="上海",
#          color="cyan",
#          linestyle="-.")
#
# # 设置x轴的刻度
# _x_ticks = ["18年8月8日{}时".format(k) for k in range(2,26,2) ]
# plt.xticks(x, _x_ticks,
#            rotation=45,
#            fontproperties=my_font)
#
# # 设置描述信息
# plt.xlabel("时间",
#            fontproperties=my_font)
# plt.ylabel("温度",
#            fontproperties=my_font)
# plt.title("温度变化图",
#           fontproperties=my_font)
#
# # 添加图例
# plt.legend(prop=my_font,
#            loc= "upper left")
#
# # 绘制网格
# plt.grid(alpha=0.3 #设置网格透明度
#          )
#
# # 存储图片
# # plt.savefig("./demo.png")
#
# # 显示图片
# plt.show()


##############################################################
# 散点图
##############################################################
# x_3 = range(1,32)
# x_10 = range(51,82)
# y_3 = [11,17,16,11,12,11,12,6,6,7,8,9,12,15,14,17,18,21,16,17,20,14,15,15,15,19,21,22,22,22,23]
# y_10 = [26,26,28,19,21,17,16,19,18,20,20,19,22,23,17,20,21,20,22,15,11,15,5,13,17,10,11,13,12,13,6]
#
# # 设置图片相关信息
# plt.figure(figsize=(15, 8),
#            dpi=80)
#
# # 画图
# plt.scatter(x_3, y_3,
#             label="三月")
# plt.scatter(x_10, y_10,
#             label="十月")
#
# # 设置x轴的刻度
# _x = list(x_3) + list(x_10)
# _x_ticks = ["3月{}日".format(k) for k in x_3 ] + ["10月{}日".format(k-50) for k in x_10]
# plt.xticks(_x[::3], _x_ticks[::3],
#            rotation=45,
#            fontproperties=my_font)
#
# # 添加图例
# plt.legend(prop=my_font,
#            loc= "upper right")
#
# # 显示
# plt.show()


##############################################################
# 条形图(竖)
##############################################################
# a = ["战狼2","速度与激情8","功夫瑜伽","西游伏妖篇","变形金刚5\n：最后的骑士","摔跤吧！爸爸","加勒比海盗5：\n死无对证","金刚：\n骷髅岛","极限特工：\n终极回归","生化危机6：\n终章","乘风破浪","神偷奶爸3","智取威虎山","大闹天竺","金刚狼3：\n殊死一战","蜘蛛侠：\n英雄归来","悟空传","银河护卫队2","情圣","新木乃伊",]
# b=[56.01,26.94,17.53,16.49,15.45,12.96,11.8,11.61,11.28,11.12,10.49,10.3,8.75,7.55,7.32,6.99,6.88,6.86,6.58,6.23]
#
# # 设置图片相关信息
# plt.figure(figsize=(15, 12),
#            dpi=80)
#
# # 画图
# plt.bar(range(len(a)), b,
#         color="orange",
#         width=0.3)
#
# # 设置x轴的刻度
# plt.xticks(range(len(a)), a,
#            rotation=45,
#            fontproperties=my_font)
#
# # 显示
# plt.show()

##############################################################
# 条形图(横)
##############################################################
# a = ["战狼2","速度与激情8","功夫瑜伽","西游伏妖篇","变形金刚5\n：最后的骑士","摔跤吧！爸爸","加勒比海盗5：\n死无对证","金刚：\n骷髅岛","极限特工：\n终极回归","生化危机6：\n终章","乘风破浪","神偷奶爸3","智取威虎山","大闹天竺","金刚狼3：\n殊死一战","蜘蛛侠：\n英雄归来","悟空传","银河护卫队2","情圣","新木乃伊",]
# b=[56.01,26.94,17.53,16.49,15.45,12.96,11.8,11.61,11.28,11.12,10.49,10.3,8.75,7.55,7.32,6.99,6.88,6.86,6.58,6.23]
#
# # 设置图片相关信息
# plt.figure(figsize=(15, 12),
#            dpi=80)
#
# # 画图
# plt.barh(range(len(a)), b,
#         color="orange",
#         height=0.3)
#
# # 设置x轴的刻度
# plt.yticks(range(len(a)), a,
#            rotation=0,
#            fontproperties=my_font)
#
# # 显示
# plt.show()


##############################################################
# 条形图(多次)
##############################################################
# a = ["猩球崛起3：终极之战","敦刻尔克","蜘蛛侠：英雄归来","战狼2"]
# b_16 = [15746,312,4497,319]
# b_15 = [12357,156,2045,168]
# b_14 = [2358,399,2358,362]
#
#
# bar_width = 0.2
#
# x_14 = list(range(len(a)))
# x_15 = [i + bar_width for i in x_14]
# x_16 = [i + bar_width for i in x_15]
#
# # 画图
# plt.bar(x_14, b_14,
#         color="orange",
#         width=0.2,
#         label="14日")
# plt.bar(x_15, b_15,
#         color="blue",
#         width=0.2,
#         label="15日")
# plt.bar(x_16, b_16,
#         color="cyan",
#         width=0.2,
#         label="16日")
#
# # 设置x轴的刻度
# plt.xticks(x_15, a,
#            rotation=0,
#            fontproperties=my_font)
#
# # 添加图例
# plt.legend(prop=my_font,
#            loc= "upper right")
#
#
# # 显示
# plt.show()


##############################################################
# 直方图
##############################################################
a=[131,  98, 125, 131, 124, 139, 131, 117, 128, 108, 135, 138, 131, 102, 107,
   114, 119, 128, 121, 142, 127, 130, 124, 101, 110, 116, 117, 110, 128, 128,
   115,  99, 136, 126, 134,  95, 138, 117, 111,  78, 132, 124, 113, 150, 110,
   117,  86,  95, 144, 105, 126, 130, 126, 130, 126, 116, 123, 106, 112, 138,
   123,  86, 101,  99, 136, 123, 117, 119, 105, 137, 123, 128, 125, 104, 109,
   134, 125, 127, 105, 120, 107, 129, 116, 108, 132, 103, 136, 118, 102, 120,
   114, 105, 115, 132, 145, 119, 121, 112, 139, 125, 138, 109, 132, 134, 156,
   106, 117, 127, 144, 139, 139, 119, 140,  83, 110, 102, 123, 107, 143, 115,
   136, 118, 139, 123, 112, 118, 125, 109, 119, 133, 112, 114, 122, 109, 106,
   123, 116, 131, 127, 115, 118, 112, 135, 115, 146, 137, 116, 103, 144,  83,
   123, 111, 110, 111, 100, 154, 136, 100, 118, 119, 133, 134, 106, 129, 126,
   110, 111, 109, 141, 120, 117, 106, 149, 122, 122, 110, 118, 127, 121, 114,
   125, 126, 114, 140, 103, 130, 141, 117, 106, 114, 121, 114, 133, 137,  92,
   121, 112, 146,  97, 137, 105,  98, 117, 112,  81,  97, 139, 113, 134, 106,
   144, 110, 137, 137, 111, 104, 117, 100, 111, 101, 110, 105, 129, 137, 112,
   120, 113, 133, 112,  83,  94, 146, 133, 101, 131, 116, 111,  84, 137, 115,
   122, 106, 144, 109, 123, 116, 111,111, 133, 150]

# 计算组数
d = 5 #组距
num_bins = (max(a) - min(a)) // d

# 画图
plt.hist(a, num_bins)

# 设置x轴的刻度
plt.xticks(range(min(a), max(a)+d,d),
           rotation=0,
           fontproperties=my_font)



# 显示
plt.show()



